examples/single_turbine_uniform_inflow/kefp_sources/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2206                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../setup"

// Disk 1
disk1
{
    type            actuatorDiskFoam;
    variant         fixed;
    selectionMode   cellSet;
    cellSet         actuationDisk1;
    diskDir         (1 0 0);
    Ct              0.6300;
    diskArea        #eval "3.14*pow($D/2,2)";
    //diskArea        1256.63;
    // For the fixed variant, you need to specify a reference velocity,
    // which should be equal to the hub height value of the inflow velocity.
    Uref_fixed       $Uh;
}


// K- and eps-source terms to avoid decay of turbulence
ScalarSemiImplicitSource1
{
    type                scalarSemiImplicitSource;
    selectionMode       all;
    volumeMode          specific;
    // Specification of sources in OpenFOAM-2206 and newer)
    sources
    {
        // Specified as ( explicit(Su), implicit(Sp) ):
        k           ($Sk 0);
        epsilon     ($Seps  0);
    }
}
